# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
import pandas as pd
import numpy as np

### Let's create a DataFrame by joinning the Series by column

In [9]:
series1 = pd.Series(np.random.randint(1,high=4,size=100))
series2= pd.Series(np.random.randint(1,high=3,size=100))
series3 = pd.Series(np.random.randint(10000,high=30000,size=100))

In [10]:
print(series1,series2,series3)

0     3
1     2
2     2
3     3
4     3
     ..
95    1
96    1
97    3
98    3
99    1
Length: 100, dtype: int64 0     2
1     2
2     2
3     2
4     1
     ..
95    2
96    2
97    2
98    1
99    2
Length: 100, dtype: int64 0     26275
1     14331
2     18663
3     27631
4     16506
      ...
95    22905
96    16801
97    11732
98    25763
99    11504
Length: 100, dtype: int64

In [14]:
house = pd.concat([series1,series2,series3],axis=1)

In [16]:
house.head()

   0  1      2
0  3  2  26275
1  2  2  14331
2  2  2  18663
3  3  2  27631
4  3  1  16506

### Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [18]:
house.rename(columns = {0:'bedr',1:'bathrs',2:'price_sqr_meter'})

    bedr  bathrs  price_sqr_meter
0      3       2            26275
1      2       2            14331
2      2       2            18663
3      3       2            27631
4      3       1            16506
..   ...     ...              ...
95     1       2            22905
96     1       2            16801
97     3       2            11732
98     3       1            25763
99     1       2            11504

[100 rows x 3 columns]

### Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

### Oops, it seems it is going only until index 99. Is it true?

### Reindex the DataFrame so it goes from 0 to 299